# identity-api - production
### Terraform Format and Style 🖌 `success`
### Terraform Initialization ⚙️ `success`
### Terraform Validation 🤖 `success`
### Terraform Plan 📖 `failure`
<details><summary>Show Plan</summary>
```terraform

module.common_resources.module.aws_lambda.data.archive_file.default: Reading...
module.common_resources.module.database_user.random_password.password: Refreshing state... [id=none]
module.common_resources.module.database_user.data.aws_ssm_parameter.cluster_id: Reading...
module.common_resources.module.kafka_topic_credential.data.aws_ssm_parameter.cluster_id: Reading...
module.common_resources.module.aws_api_gateway.aws_apigatewayv2_api.default: Refreshing state... [id=t3aht519nl]
module.common_resources.module.aws_lambda.aws_cloudwatch_log_group.default: Refreshing state... [id=/aws/lambda/production-identity-api]
module.common_resources.module.aws_lambda.data.aws_iam_policy_document.default: Reading...
module.common_resources.module.aws_lambda.data.aws_iam_policy_document.default: Read complete after 0s [id=3693445097]
module.common_resources.module.aws_lambda.aws_iam_role.default: Refreshing state... [id=lambda-execution-identity-api-production]
module.common_resources.module.kafka_topic_credential.data.aws_ssm_parameter.cluster_id: Read complete after 0s [id=production-kafka-cluster-id]
module.common_resources.module.kafka_topic_credential.upstash_kafka_credential.default: Refreshing state... [id=upstash-kafka-credential-753f3de9-8a82-42f2-a2e8-93bb6be27e04]
module.common_resources.module.database_user.data.aws_ssm_parameter.cluster_id: Read complete after 0s [id=production-cockroachdb-serverless-cluster-id]
module.common_resources.module.database_user.cockroach_sql_user.default: Refreshing state... [id=2539ad74-c3bc-4b10-bb6e-e55edf9e9fbf:production-identity-api]
module.common_resources.module.aws_lambda.aws_iam_role_policy_attachment.default: Refreshing state... [id=lambda-execution-identity-api-production-20230427100939793100000001]
module.common_resources.module.aws_api_gateway.aws_cloudwatch_log_group.default: Refreshing state... [id=/aws/api_gateway/production_identity_api]
module.common_resources.module.aws_api_gateway.aws_ssm_parameter.default: Refreshing state... [id=production_identity_api_endpoint]
module.common_resources.module.aws_api_gateway.aws_apigatewayv2_stage.default: Refreshing state... [id=$default]
module.common_resources.module.aws_lambda.data.archive_file.default: Read complete after 1s [id=7a714ac2462de21a3426d4b788dde3c448f22b9c]
module.common_resources.module.aws_lambda.aws_lambda_function.default: Refreshing state... [id=production-identity-api]
module.common_resources.module.aws_api_gateway.aws_lambda_permission.default: Refreshing state... [id=AllowExecutionFromAPIGateway]
module.common_resources.module.aws_api_gateway.aws_apigatewayv2_integration.default: Refreshing state... [id=5p6pizc]
module.common_resources.module.aws_api_gateway.aws_apigatewayv2_route.any: Refreshing state... [id=rt26i3v]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
-/+ destroy and then create replacement
 <= read (data resources)

Terraform planned the following actions, but then encountered a problem:

  # module.common_resources.module.aws_api_gateway.aws_apigatewayv2_integration.default will be updated in-place
  ~ resource "aws_apigatewayv2_integration" "default" {
        id                     = "5p6pizc"
      ~ integration_uri        = "arn:aws:apigateway:us-east-1:lambda:path/2015-03-31/functions/arn:aws:lambda:us-east-1:514472330244:function:production-identity-api/invocations" -> (known after apply)
        # (8 unchanged attributes hidden)
    }

  # module.common_resources.module.aws_api_gateway.aws_lambda_permission.default must be replaced
-/+ resource "aws_lambda_permission" "default" {
      ~ function_name       = "production-identity-api" -> "production_identity_api" # forces replacement
      ~ id                  = "AllowExecutionFromAPIGateway" -> (known after apply)
      + statement_id_prefix = (known after apply)
        # (4 unchanged attributes hidden)
    }

  # module.common_resources.module.aws_lambda.aws_cloudwatch_log_group.default must be replaced
-/+ resource "aws_cloudwatch_log_group" "default" {
      ~ arn               = "arn:aws:logs:us-east-1:514472330244:log-group:/aws/lambda/production-identity-api" -> (known after apply)
      ~ id                = "/aws/lambda/production-identity-api" -> (known after apply)
      ~ name              = "/aws/lambda/production-identity-api" -> "/aws/lambda/production_identity_api" # forces replacement
      + name_prefix       = (known after apply)
        tags              = {
            "domain"        = "identity"
            "environment"   = "production"
            "resource"      = "identity-api"
            "resource_type" = "lambda"
        }
        # (3 unchanged attributes hidden)
    }

  # module.common_resources.module.aws_lambda.aws_iam_role.default must be replaced
-/+ resource "aws_iam_role" "default" {
      ~ arn                   = "arn:aws:iam::514472330244:role/lambda-execution-identity-api-production" -> (known after apply)
      ~ create_date           = "2023-04-27T10:09:39Z" -> (known after apply)
      ~ id                    = "lambda-execution-identity-api-production" -> (known after apply)
      ~ managed_policy_arns   = [
          - "arn:aws:iam::aws:policy/service-role/AWSLambdaBasicExecutionRole",
        ] -> (known after apply)
      ~ name                  = "lambda-execution-identity-api-production" -> "lambda-execution-production_identity_api" # forces replacement
      + name_prefix           = (known after apply)
      ~ role_last_used        = [
          - {
              - last_used_date = ""
              - region         = ""
            },
        ] -> (known after apply)
        tags                  = {
            "domain"        = "identity"
            "environment"   = "production"
            "resource"      = "identity-api"
            "resource_type" = "lambda"
        }
      ~ unique_id             = "AROAXPSHQYQCBNW6CQ6UM" -> (known after apply)
        # (5 unchanged attributes hidden)
    }

  # module.common_resources.module.aws_lambda.aws_iam_role_policy_attachment.default must be replaced
-/+ resource "aws_iam_role_policy_attachment" "default" {
      ~ id         = "lambda-execution-identity-api-production-20230427100939793100000001" -> (known after apply)
      ~ role       = "lambda-execution-identity-api-production" -> "lambda-execution-production_identity_api" # forces replacement
        # (1 unchanged attribute hidden)
    }

  # module.common_resources.module.aws_lambda.aws_lambda_function.default must be replaced
-/+ resource "aws_lambda_function" "default" {
      ~ architectures                  = [
          - "x86_64",
        ] -> (known after apply)
      ~ arn                            = "arn:aws:lambda:us-east-1:514472330244:function:production-identity-api" -> (known after apply)
      ~ function_name                  = "production-identity-api" -> "production_identity_api" # forces replacement
      ~ id                             = "production-identity-api" -> (known after apply)
      ~ invoke_arn                     = "arn:aws:apigateway:us-east-1:lambda:path/2015-03-31/functions/arn:aws:lambda:us-east-1:514472330244:function:production-identity-api/invocations" -> (known after apply)
      ~ last_modified                  = "2023-04-28T04:59:38.000+0000" -> (known after apply)
      - layers                         = [] -> null
      ~ qualified_arn                  = "arn:aws:lambda:us-east-1:514472330244:function:production-identity-api:$LATEST" -> (known after apply)
      ~ qualified_invoke_arn           = "arn:aws:apigateway:us-east-1:lambda:path/2015-03-31/functions/arn:aws:lambda:us-east-1:514472330244:function:production-identity-api:$LATEST/invocations" -> (known after apply)
      ~ role                           = "arn:aws:iam::514472330244:role/lambda-execution-identity-api-production" -> (known after apply)
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      ~ source_code_size               = 18216814 -> (known after apply)
        tags                           = {
            "domain"        = "identity"
            "environment"   = "production"
            "resource"      = "identity-api"
            "resource_type" = "lambda"
        }
      ~ version                        = "$LATEST" -> (known after apply)
        # (11 unchanged attributes hidden)

      ~ environment {
          ~ variables = {
              - "CONNECTILLY_POSTGRES_CONNECTIONSTRING" = (sensitive value)
            } -> (known after apply)
        }

      - ephemeral_storage {
          - size = 512 -> null
        }

      - tracing_config {
          - mode = "PassThrough" -> null
        }
    }

  # module.common_resources.module.database_user.data.cockroach_connection_string.default will be read during apply
  # (config refers to values not yet known)
 <= data "cockroach_connection_string" "default" {
      + connection_params = (known after apply)
      + connection_string = (known after apply)
      + database          = "production-identity"
      + id                = (sensitive value)
      + os                = (known after apply)
      + password          = (sensitive value)
      + sql_user          = "production-identity_api"
    }

  # module.common_resources.module.database_user.cockroach_sql_user.default must be replaced
-/+ resource "cockroach_sql_user" "default" {
      ~ id         = "2539ad74-c3bc-4b10-bb6e-e55edf9e9fbf:production-identity-api" -> (known after apply)
      ~ name       = "production-identity-api" -> "production-identity_api" # forces replacement
      ~ password   = (sensitive value)
        # (1 unchanged attribute hidden)
    }

  # module.common_resources.module.database_user.random_password.password must be replaced
-/+ resource "random_password" "password" {
      ~ bcrypt_hash      = (sensitive value)
      ~ id               = "none" -> (known after apply)
      ~ keepers          = { # forces replacement
          ~ "random_seed" = "16a478ef-a8dc-4b57-82f7-3c29af390114" -> "d8187aa2-218c-40c7-805e-a8c68f8857f0"
        }
      ~ result           = (sensitive value)
        # (11 unchanged attributes hidden)
    }

Plan: 7 to add, 1 to change, 7 to destroy.

Changes to Outputs:
  ~ database_user_connection_string = (sensitive value)

```
</details>
*Pushed by: @mortezaalizadeh, Action: `pull_request`*